app/Controllers/Home.php

    public function deleteTask()
    {
        $tasks = new tasksModel();
        $id = $this->request->getVar('id');
        $eliminarTask = $tasks->delete($id);
---
DELETE FROM `tasks`
WHERE `id` IN ('10')