app/Models/tasksModel.php

SELECT *
FROM `tasks`
---
    public function get()
    {
        $query = $this->db->table('tasks');
        return $query->get()->getResultArray();

INSERT INTO `tasks` (`title`, `description`, `completed`, `created_at`) VALUES ('Test 5', 'sdfhbs,dmfbksdjbfksjd', 0, '2024-12-27')
---
    public function addTask($data){
        $query = $this->db->table($this->table)->insert($data);

UPDATE `tasks` SET `title` = 'Cena de Fin de Año', `description` = 'Esta cena se realizará el sábado 28 de Diciembre de 2024', `completed` = '1', `updated_at` = '2024-12-27'
WHERE `Id` = '11'
---
    public function updateTask($id, $data){

        $actualizar = $this->db->table('tasks');
        $actualizar->where("Id", $id);
        $actualizar->update($data);